AWS_RedisCluster/6_redis/4Stress_vm2.txt
====== PING_INLINE ======
  100000 requests completed in 7.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
2.44% <= 2 milliseconds
29.59% <= 3 milliseconds
69.60% <= 4 milliseconds
92.19% <= 5 milliseconds
98.23% <= 6 milliseconds
99.31% <= 7 milliseconds
99.57% <= 8 milliseconds
99.69% <= 9 milliseconds
99.85% <= 10 milliseconds
99.96% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 203 milliseconds
100.00% <= 206 milliseconds
100.00% <= 208 milliseconds
13659.34 requests per second

====== PING_BULK ======
  100000 requests completed in 6.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
7.62% <= 2 milliseconds
50.55% <= 3 milliseconds
85.98% <= 4 milliseconds
96.02% <= 5 milliseconds
98.45% <= 6 milliseconds
99.24% <= 7 milliseconds
99.57% <= 8 milliseconds
99.71% <= 9 milliseconds
99.79% <= 10 milliseconds
99.80% <= 11 milliseconds
99.84% <= 12 milliseconds
99.89% <= 13 milliseconds
99.94% <= 14 milliseconds
99.97% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 206 milliseconds
100.00% <= 209 milliseconds
100.00% <= 210 milliseconds
15535.19 requests per second

====== SET ======
  100000 requests completed in 5.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
19.06% <= 2 milliseconds
72.75% <= 3 milliseconds
93.34% <= 4 milliseconds
97.80% <= 5 milliseconds
98.85% <= 6 milliseconds
99.29% <= 7 milliseconds
99.52% <= 8 milliseconds
99.71% <= 9 milliseconds
99.76% <= 10 milliseconds
99.80% <= 11 milliseconds
99.82% <= 12 milliseconds
99.86% <= 13 milliseconds
99.88% <= 14 milliseconds
99.92% <= 15 milliseconds
99.95% <= 16 milliseconds
99.98% <= 17 milliseconds
100.00% <= 203 milliseconds
17630.46 requests per second

====== GET ======
  100000 requests completed in 5.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
14.13% <= 2 milliseconds
65.81% <= 3 milliseconds
93.71% <= 4 milliseconds
98.89% <= 5 milliseconds
99.57% <= 6 milliseconds
99.70% <= 7 milliseconds
99.79% <= 8 milliseconds
99.81% <= 9 milliseconds
99.82% <= 10 milliseconds
99.85% <= 12 milliseconds
99.85% <= 13 milliseconds
99.92% <= 14 milliseconds
99.98% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 203 milliseconds
100.00% <= 206 milliseconds
17455.05 requests per second

====== INCR ======
  100000 requests completed in 7.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
5.23% <= 2 milliseconds
27.00% <= 3 milliseconds
61.17% <= 4 milliseconds
85.76% <= 5 milliseconds
96.06% <= 6 milliseconds
99.00% <= 7 milliseconds
99.67% <= 8 milliseconds
99.84% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 206 milliseconds
100.00% <= 206 milliseconds
13002.21 requests per second

====== LPUSH ======
  100000 requests completed in 7.04 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
9.75% <= 2 milliseconds
39.39% <= 3 milliseconds
69.02% <= 4 milliseconds
88.51% <= 5 milliseconds
96.85% <= 6 milliseconds
99.26% <= 7 milliseconds
99.75% <= 8 milliseconds
99.89% <= 9 milliseconds
99.95% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 204 milliseconds
100.00% <= 206 milliseconds
100.00% <= 208 milliseconds
100.00% <= 209 milliseconds
14212.62 requests per second

====== RPUSH ======
  100000 requests completed in 5.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
20.90% <= 2 milliseconds
77.74% <= 3 milliseconds
95.54% <= 4 milliseconds
97.97% <= 5 milliseconds
99.18% <= 6 milliseconds
99.71% <= 7 milliseconds
99.88% <= 8 milliseconds
99.92% <= 9 milliseconds
99.94% <= 10 milliseconds
99.96% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 14 milliseconds
19018.64 requests per second

====== LPOP ======
  100000 requests completed in 7.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
3.39% <= 2 milliseconds
37.78% <= 3 milliseconds
79.11% <= 4 milliseconds
92.43% <= 5 milliseconds
96.60% <= 6 milliseconds
97.60% <= 7 milliseconds
98.33% <= 8 milliseconds
98.77% <= 9 milliseconds
99.13% <= 10 milliseconds
99.22% <= 11 milliseconds
99.37% <= 12 milliseconds
99.51% <= 13 milliseconds
99.55% <= 14 milliseconds
99.60% <= 15 milliseconds
99.64% <= 16 milliseconds
99.70% <= 17 milliseconds
99.71% <= 18 milliseconds
99.74% <= 20 milliseconds
99.76% <= 21 milliseconds
99.76% <= 22 milliseconds
99.82% <= 23 milliseconds
99.85% <= 30 milliseconds
99.86% <= 34 milliseconds
99.90% <= 55 milliseconds
99.92% <= 56 milliseconds
99.95% <= 60 milliseconds
99.96% <= 61 milliseconds
100.00% <= 61 milliseconds
13709.90 requests per second

====== RPOP ======
  100000 requests completed in 6.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
7.51% <= 2 milliseconds
51.40% <= 3 milliseconds
88.80% <= 4 milliseconds
98.35% <= 5 milliseconds
99.68% <= 6 milliseconds
99.82% <= 7 milliseconds
99.88% <= 8 milliseconds
99.93% <= 9 milliseconds
99.95% <= 11 milliseconds
100.00% <= 204 milliseconds
100.00% <= 207 milliseconds
100.00% <= 207 milliseconds
16000.00 requests per second

====== SADD ======
  100000 requests completed in 6.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
1.46% <= 2 milliseconds
40.16% <= 3 milliseconds
82.52% <= 4 milliseconds
97.13% <= 5 milliseconds
99.54% <= 6 milliseconds
99.86% <= 7 milliseconds
99.94% <= 8 milliseconds
99.95% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14708.05 requests per second

====== HSET ======
  100000 requests completed in 5.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
14.48% <= 2 milliseconds
64.57% <= 3 milliseconds
92.09% <= 4 milliseconds
97.75% <= 5 milliseconds
98.81% <= 6 milliseconds
99.39% <= 7 milliseconds
99.67% <= 8 milliseconds
99.82% <= 9 milliseconds
99.90% <= 10 milliseconds
99.93% <= 11 milliseconds
99.97% <= 12 milliseconds
100.00% <= 12 milliseconds
17277.12 requests per second

====== SPOP ======
  100000 requests completed in 5.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
15.70% <= 2 milliseconds
66.02% <= 3 milliseconds
91.02% <= 4 milliseconds
97.85% <= 5 milliseconds
99.27% <= 6 milliseconds
99.61% <= 7 milliseconds
99.75% <= 8 milliseconds
99.83% <= 9 milliseconds
99.85% <= 10 milliseconds
99.86% <= 11 milliseconds
99.89% <= 12 milliseconds
99.90% <= 14 milliseconds
99.93% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 16 milliseconds
17421.60 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 5.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
19.11% <= 2 milliseconds
75.37% <= 3 milliseconds
95.12% <= 4 milliseconds
98.55% <= 5 milliseconds
99.53% <= 6 milliseconds
99.84% <= 7 milliseconds
99.92% <= 8 milliseconds
99.93% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 202 milliseconds
100.00% <= 204 milliseconds
100.00% <= 206 milliseconds
18604.65 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 5.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
20.75% <= 2 milliseconds
78.54% <= 3 milliseconds
97.07% <= 4 milliseconds
99.44% <= 5 milliseconds
99.82% <= 6 milliseconds
99.92% <= 7 milliseconds
99.94% <= 8 milliseconds
99.95% <= 9 milliseconds
99.96% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 202 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
18628.91 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.04 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
21.67% <= 2 milliseconds
81.61% <= 3 milliseconds
98.65% <= 4 milliseconds
99.85% <= 5 milliseconds
99.94% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 7 milliseconds
19841.27 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
18.73% <= 2 milliseconds
71.84% <= 3 milliseconds
94.32% <= 4 milliseconds
98.38% <= 5 milliseconds
99.35% <= 6 milliseconds
99.74% <= 7 milliseconds
99.87% <= 8 milliseconds
99.89% <= 9 milliseconds
99.89% <= 10 milliseconds
99.90% <= 14 milliseconds
99.90% <= 15 milliseconds
99.91% <= 16 milliseconds
99.93% <= 17 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
99.97% <= 20 milliseconds
99.98% <= 21 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
100.00% <= 207 milliseconds
18288.22 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 5.40 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
17.56% <= 2 milliseconds
72.56% <= 3 milliseconds
96.61% <= 4 milliseconds
99.71% <= 5 milliseconds
99.90% <= 6 milliseconds
99.94% <= 7 milliseconds
99.97% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
100.00% <= 205 milliseconds
18532.25 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 6.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
9.22% <= 2 milliseconds
45.53% <= 3 milliseconds
78.52% <= 4 milliseconds
94.88% <= 5 milliseconds
98.81% <= 6 milliseconds
99.71% <= 7 milliseconds
99.90% <= 8 milliseconds
99.94% <= 10 milliseconds
99.94% <= 11 milliseconds
99.97% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 204 milliseconds
99.99% <= 205 milliseconds
100.00% <= 206 milliseconds
100.00% <= 207 milliseconds
100.00% <= 209 milliseconds
100.00% <= 209 milliseconds
14920.92 requests per second